{
    "mainFunc": "A function is the main unit in a 'Simply' program. We always start a program inside the ‘main’ function. Click 'Next' to go into the main function.",
    "functions": "A function is the main unit in a 'Simply' program. We always start a program inside the ‘main’ function.",
    "insideFunctions": "Right now we are inside the function called ",
    "variables": "This line is using variables. A variable is like a container that stores information. We can change the values stored using the computer program.",
    "varTable": "If you click on the 'Next' button, you can see the value appear in the Variables and Constants table.",
    "conditions": "This line is using an 'if' statement. We can tell a computer program what path to follow by using some conditions. If a condition is true the program can follow one path and if it's not it can follow another. If you click the 'Next' button, you can see if this condition is true or false in the IF Conditions table.",
    "loops": "We use loops to tell a program to do something again and again. In 'Simply', we use a 'repeat' statement to do this. If you click on the 'Next' button, you can see how many times this loop will run in the Loops table.",
    "keyins": "A program can take some data from the user (you) before running. They are called user inputs.",
    "prints": "Sometimes we need to display some data to the screen for the user to see. In 'Simply', we use a 'display' statement to do this. Check the 'Display' box to see what will appear on the screen when you finally run this program.",
    "externals": "Sometimes we can’t write all the instructions we need inside our program. When that happens we can get some other files to help us. These files are called external libraries. Check the 'External Libraries' box to see what files we are using in this program.",
    "return": "A 'return' statement tells a function what it should output. The data type of the return value of a function should always match the type defined by the function's 'out' parameter. If you click the 'Next' button, you will see the updated value in the Variables and Constants table of the calling function."
}